# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.
# 4 -> 1 2 3 4
# 9

bush_n = int(input("Введите количество кустов черники: "))

bushs = list()
for i in range(bush_n):
    berry_n = int(input('Введите количество ягод на кусте: '))
    bushs.append(berry_n)

count_bush = list()
for i in range(len(bushs)):
    count_bush.append(bushs[i] + bushs[i-1] + bushs[i-2])
print(f'Максимальное число ягод -> {max(count_bush)}')
